Разработка_GZ/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолномочий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаБухгалтерскиеРегистры</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаНалоговыеРегистры</name>
  </enumValues>
  <enumValues>
    <name>УполномоченныйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаОформление</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/InformationRegisters/ОтветственныеЛицаОрганизаций/Forms/ФормаИстории/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ОтветственноеЛицо") тогда
		Если Параметры.Отбор.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель тогда	
			ЭтаФорма.Заголовок = "История подписи: Ответственный за статистическую отчетность";
		иначе
			ЭтаФорма.Заголовок = "История подписи: "+Параметры.Отбор.ОтветственноеЛицо;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
